export const SUB_HUNDRED_NP: Array<string> = [
    'शून्य', 'एक', 'दुई', 'तीन', 'चार', 'पाँच', 'छ', 'सात', 'आठ', 'नौ', 'दश',
    'एघार', 'बाह्र', 'तेह्र', 'चौध', 'पन्ध्र', 'सोह्र', 'सत्र', 'अठार', 'उन्नाइस', 'बीस',
    'एक्काइस', 'बाइस', 'तेईस', 'चौबीस', 'पच्चीस', 'छब्बीस', 'सत्ताइस', 'अट्ठाइस', 'उनन्तीस', 'तीस',
    'एकतीस', 'बत्तीस', 'तेत्तिस', 'चौंतीस', 'पैंतीस', 'छत्तीस', 'सैंतीस', 'अठ्तीस', 'उनन्चालीस', 'चालीस',
    'एकचालीस', 'बयालीस', 'त्रिचालीस', 'चवालीस', 'पैंतालीस', 'छयालीस', 'सत्चालीस', 'अठ्चालीस', 'उनन्चास', 'पचास',
    'एकाउन्न', 'बाउन्न', 'त्रिपन्न', 'चवन्न', 'पचपन्न', 'छपन्न', 'सन्ताउन्न', 'अन्ठाउन्न', 'उनन्साठी', 'साठी',
    'एकसट्ठी', 'बासट्ठी', 'त्रिसट्ठी', 'चौंसट्ठी', 'पैंसट्ठी', 'छैसट्ठी', 'सत्सट्ठी', 'अठ्सट्ठी', 'उनन्सत्तरी', 'सत्तरी',
    'एकहत्तर', 'बहत्तर', 'त्रिहत्तर', 'चौहत्तर', 'पचहत्तर', 'छयहत्तर', 'सतहत्तर', 'अठहत्तर', 'उनासी', 'असी',
    'एकासी', 'बयासी', 'त्रियासी', 'चैरासी', 'पचासी', 'छयासी', 'सतासी', 'अठासी', 'उनान्नब्बे', 'नब्बे',
    'एकानब्बे', 'बयानब्बे', 'त्रियानब्बे', 'चौरानब्बे', 'पंचानब्बे', 'छयानब्बे', 'सन्तानब्बे', 'अन्ठान्नब्बे', 'उनान्सय'
    
];

export const TENTH_MAPPING_NP: any = {
  1:            'एक',
  10:           'दश',
  100:          'सय',
  1000:         'हजार',
  100000:       'लाख',
  10000000:     'करोड',
  1000000000:   'अर्ब',
  100000000000: 'खर्ब'
};

export enum OtherWordsNp {
  minus = 'माइनस',
  point = 'दशमलब'
}
